Revit 2027 API
BuiltInFailures.ImportFailures.IFCCantUpdateLinkedFile Property
 The cached version of this IFC file is already loaded into another document in this session, and can't be updated. To update the IFC file, please close all other documents containing the link, and then update.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId IFCCantUpdateLinkedFile { get; }
Public Shared ReadOnly Property IFCCantUpdateLinkedFile As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ IFCCantUpdateLinkedFile {
	FailureDefinitionId^ get ();
}
static member IFCCantUpdateLinkedFile : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ImportFailures Class
Autodesk.Revit.DB Namespace